org/roam/zfs.org
:PROPERTIES:
:ID:       382f92d4-f76f-47b1-b4dd-33a39c11aaa2
:END:
#+title: zfs
#+OPTIONS: toc:nil num:nil date:nil \n:nil html-style:nil author:nil timestamp:nil title:nil html-postamble:nil html5-fancy:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-default.css" />
#+HTML_CONTENT_CLASS: container
#+HTML_DOCTYPE: html5
#+INCLUDE: "css.org::navbar" :only-contents t
* ZFS
** openzfs
*** install
- (This may break pool import) If given whole disk zfs will leave small partition at begin/end and mark it with a wholedisk property.
  That small space is useful for uefi bootloader via: (zfs raidz expansion uses this since 2.2.0)
  ~mkfs.vfat -F 16 /dev/disk/by-uuid/XXXXXX~ and
  ~grub-install --target=x86_64-efi --efi-directory=/boot/efi --bootloader-id=DISK1~.
  A larger partition can allow proper fat32 fs type, grub installation(~--boot-directory~) and kernel/initramfs storage.
- add to kmod to initramfs via mkinitcpio/dracut
  - ex. add zfs to HOOKS in ~/etc/defaults/mkinitcpio.conf~
  - regen initramfs ~mkinitcpio -P~
- update-grub with zfs root (if on root)
- Pam module for auto decrypt/mount on user login
  - /etc/pam.d/zfs-key
#+NAME: zfs-key-pam
#+BEGIN_SRC conf :tangle no
     auth       optional                    pam_zfs_key.so homes=zroot/data/home runstatedir=/run/pam_zfs_key
     session [success=1 default=ignore]     pam_succeed_if.so service = systemd-user quiet
     session    optional                    pam_zfs_key.so homes=zroot/data/home runstatedir=/run/pam_zfs_key
     password   optional                    pam_zfs_key.so homes=zroot/data/home runstatedir=/run/pam_zfs_key
#+END_SRC
  - /etc/pam.d/system-auth and /etc/pam.d/su-l
     auth       include      zfs-key
     session    include      zfs-key
     password   include      zfs-key
- Manual pam script
  - ~/etc/pam.d/system-auth~
    ~auth       optional                    pam_exec.so      expose_authtok /sbin/zfs-pam-login~
    - zfs-pam-login
       ~PASS=$(cat -)~
       ~zfs load-key "${ZFS_HOME_VOL}" <<< "${PASS}" || continue~
       ~zfs mount "${ZFS_HOME_VOL}" || true~
- add systemd services for device scanning/import/automounting
  - set cache if not scanning for pools ~zpool set cachefile=/etc/zfs/zpool.cache POOL~
    - ~systemctl enable zfs-import-cache~
    - ~systemctl enable zfs-import.target~
  - enable mounts if not using ZED
    - ~systemctl enable zfs-mount~
    - ~systemctl enable zfs.target~
- set arc memory in kernel params(grub), initramfs ~/etc/default/zfs~ or modprobe params ~/etc/modprobe.d/zfs.conf~
*** usage
- ~zpool~  scrub(error check), resilver(parity), trim(ssd), adding/removing disks
- ~zfs~ Mounting, keys, snapshots, rollbacks
