zfs.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>zfs</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container">
<nav aria-label="breadcrumb" style="--pico-nav-breadcrumb-divider: '|';" id="orgdf71bd4">
<ul class="org-ul">
<li><a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a></li>
<li><a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a></li>
</ul>
</nav>
<div id="outline-container-orge92fc0b" class="outline-2">
<h2 id="orge92fc0b">ZFS</h2>
<div class="outline-text-2" id="text-orge92fc0b">
</div>
<div id="outline-container-orgcb533fb" class="outline-3">
<h3 id="orgcb533fb">openzfs</h3>
<div class="outline-text-3" id="text-orgcb533fb">
</div>
<div id="outline-container-org26bd50f" class="outline-4">
<h4 id="org26bd50f">install</h4>
<div class="outline-text-4" id="text-org26bd50f">
<ul class="org-ul">
<li>(This may break pool import) If given whole disk zfs will leave small partition at begin/end and mark it with a wholedisk property.
That small space is useful for uefi bootloader via: (zfs raidz expansion uses this since 2.2.0)
<code>mkfs.vfat -F 16 /dev/disk/by-uuid/XXXXXX</code> and
<code>grub-install --target=x86_64-efi --efi-directory=/boot/efi --bootloader-id=DISK1</code>.
A larger partition can allow proper fat32 fs type, grub installation(<code>--boot-directory</code>) and kernel/initramfs storage.</li>
<li>add to kmod to initramfs via mkinitcpio/dracut
<ul class="org-ul">
<li>ex. add zfs to HOOKS in <code>/etc/defaults/mkinitcpio.conf</code></li>
<li>regen initramfs <code>mkinitcpio -P</code></li>
</ul></li>
<li>update-grub with zfs root (if on root)</li>
<li>Pam module for auto decrypt/mount on user login
<ul class="org-ul">
<li>/etc/pam.d/zfs-key</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-conf" id="orgaf2cfee">auth       optional                    pam_zfs_key.so homes=zroot/data/home runstatedir=/run/pam_zfs_key
session [success=1 default=ignore]     pam_succeed_if.so service = systemd-user quiet
session    optional                    pam_zfs_key.so homes=zroot/data/home runstatedir=/run/pam_zfs_key
password   optional                    pam_zfs_key.so homes=zroot/data/home runstatedir=/run/pam_zfs_key
</pre>
</div>
<ul class="org-ul">
<li>/etc/pam.d/system-auth and /etc/pam.d/su-l
auth       include      zfs-key
session    include      zfs-key
password   include      zfs-key</li>
</ul>
<ul class="org-ul">
<li>Manual pam script
<ul class="org-ul">
<li><code>/etc/pam.d/system-auth</code>
<code>auth       optional                    pam_exec.so      expose_authtok /sbin/zfs-pam-login</code>
<ul class="org-ul">
<li>zfs-pam-login
<code>PASS=$(cat -)</code>
<code>zfs load-key "${ZFS_HOME_VOL}" &lt;&lt;&lt; "${PASS}" || continue</code>
<code>zfs mount "${ZFS_HOME_VOL}" || true</code></li>
</ul></li>
</ul></li>
<li>add systemd services for device scanning/import/automounting
<ul class="org-ul">
<li>set cache if not scanning for pools <code>zpool set cachefile=/etc/zfs/zpool.cache POOL</code>
<ul class="org-ul">
<li><code>systemctl enable zfs-import-cache</code></li>
<li><code>systemctl enable zfs-import.target</code></li>
</ul></li>
<li>enable mounts if not using ZED
<ul class="org-ul">
<li><code>systemctl enable zfs-mount</code></li>
<li><code>systemctl enable zfs.target</code></li>
</ul></li>
</ul></li>
<li>set arc memory in kernel params(grub), initramfs <code>/etc/default/zfs</code> or modprobe params <code>/etc/modprobe.d/zfs.conf</code></li>
</ul>
</div>
</div>
<div id="outline-container-org893a00a" class="outline-4">
<h4 id="org893a00a">usage</h4>
<div class="outline-text-4" id="text-org893a00a">
<ul class="org-ul">
<li><code>zpool</code>  scrub(error check), resilver(parity), trim(ssd), adding/removing disks</li>
<li><code>zfs</code> Mounting, keys, snapshots, rollbacks</li>
</ul>
</div>
</div>
